#include <iostream> //Подключение библиотеки для ввода и вывода
#include <clocale> //Библиотека для кириллицы

using namespace std; //Пространство имен для ввода и вывода

float m, n; //Объявление переменных

int main(){ //Начало главной функции
    setlocale(LC_ALL, ".65001"); //Подключение кириллицы
    cout << "Введите m и n:" << "\n"; //Сообщение о вводе значений
    cin >> m >> n; //Ввод значений
    cout << "1) ++n*++m = "; //Для первого пункта
    cout << ++n * ++m << "\n"; //Ответ для первого пункта
    cout << "2) m++<n = "; //Для второго пункта
    cout << (m++ < n) << "\n"; //Ответ для второго пункта
    cout << "3) n++>m = "; //Для третьего пункта
    cout << (n++ > m); //Ответ для третьего пункта
} //Конец главной функции